"""If28. Дан номер года (положительное целое число). Определить количество дней в этом году, учитывая, что обычный год насчитывает 365 дней, а високосный — 366 дней. Високосным считается год, делящийся на 4, за исключением тех годов, которые делятся на 100 и не делятся на 400 (например, годы 300, 1300 и 1900 не являются високосными, а 1200 и 2000 — являются)."""
import math
Y, = map(int, input().split())
result = 366 if Y%400==0 or (Y%4==0 and Y%100!=0) else 365
print(*result if isinstance(result, tuple) else (result,))
