"""Case13. Элементы равнобедренного прямоугольного треугольника пронуме- рованы следующим образом: 1 — катет a, 2 — гипотенуза c = a· √ 2, 3 — высота h, опущенная на гипотенузу (h = c/2), 4 — площадь S = c·h/2. Дан номер одного из этих элементов и его значение. Вывести значения остальных элементов данного треугольника (в том же порядке)."""
import math
k,x=map(float,input().split()); k=int(k); a={1:x,2:x/math.sqrt(2),3:x*math.sqrt(2),4:math.sqrt(2*x)}[k]; v=[a,a*math.sqrt(2),a/math.sqrt(2),a*a/2]; print(*(v[:k-1]+v[k:]))
