"""Case14. Элементы равностороннего треугольника пронумерованы следую- щим образом: 1 — сторона a, 2 — радиус R1 вписанной окружности (R1 = a· √ 3/6), 3 — радиус R2 описанной окружности (R2 = 2·R1), 4 — площадь S = a2· √ 3/4. Дан номер одного из этих элементов и его значение. Вывести значения остальных элементов данного треугольника (в том же порядке)."""
import math
k,x=map(float,input().split()); k=int(k); a={1:x,2:x/3,3:math.sqrt(4*x/math.sqrt(3))}[k]; v=[a,3*a,a*a*math.sqrt(3)/4]; print(*(v[:k-1]+v[k:]))
