"""Case12. Элементы окружности пронумерованы следующим образом: 1 — ра- диус R, 2 — диаметр D = 2·R, 3 — длина L = 2·π·R, 4 — площадь кру- га S = π·R2. Дан номер одного из этих элементов и его значение. Вывести значения остальных элементов данной окружности (в том же порядке). В качестве значения π использовать 3.14."""
import math
k,x=map(float,input().split()); k=int(k); r={1:x,2:x/2,3:x/(2*3.14),4:(x/3.14)**.5}[k]; vals={1:(2*r,2*3.14*r,3.14*r*r),2:(r,2*3.14*r,3.14*r*r),3:(r,2*r,3.14*r*r),4:(r,2*r,2*3.14*r)}[k]; print(*vals)
