"""Proc22. Описать функцию Calc(A, B, Op) вещественного типа, выполняющую над ненулевыми вещественными числами A и B одну из арифметических 34 М. Э. Абрамян. Электронный задачник Programming Taskbook 4.4 операций и возвращающую ее результат. Вид операции определяется це- лым параметром Op: 1 — вычитание, 2 — умножение, 3 — деление, осталь- ные значения — сложение. С помощью Calc выполнить для данных A и B операции, определяемые данными целыми N1, N2, N3."""
import math
from math import sqrt
def solve(*values):
    v=list(values)
    a,b,op= v; return {1:a-b,2:a*b,3:a/b}.get(int(op),a+b)
if __name__ == "__main__":
    data=list(map(float,input().split()))
    print(solve(*data))
