"""Proc5. Описать процедуру RectPS(x1, y1, x2, y2, P, S), вычисляющую периметр P и площадь S прямоугольника со сторонами, параллельными осям ко- ординат, по координатам (x1, y1), (x2, y2) его противоположных вершин (x1, y1, x2, y2 — входные, P и S — выходные параметры вещественного ти- па). С помощью этой процедуры найти периметры и площади трех пря- моугольников с данными противоположными вершинами."""
import math
from math import sqrt
def solve(*values):
    v=list(values)
    return [(2*(abs(x1-x2)+abs(y1-y2)),abs(x1-x2)*abs(y1-y2)) for x1,y1,x2,y2 in zip(v[::4],v[1::4],v[2::4],v[3::4])]
if __name__ == "__main__":
    data=list(map(float,input().split()))
    print(solve(*data))
