"""Proc15. Описать процедуру ShiftLeft3(A, B, C), выполняющую левый цикли- ческий сдвиг: значение A переходит в C, значение C — в B, значение B — в A (A, B, C — вещественные параметры, являющиеся одновременно входными и выходными). С помощью этой процедуры выполнить левый циклический сдвиг для двух данных наборов из трех чисел: (A1, B1, C1) и (A2, B2, C2). Процедуры и функции 33 Функции с числовыми параметрами"""
import math
from math import sqrt
def solve(*values):
    v=list(values)
    return [(v[i+1],v[i+2],v[i]) for i in (0,3)]
if __name__ == "__main__":
    data=list(map(float,input().split()))
    print(solve(*data))
