"""Proc60. Используя функцию Dist из задания Proc59, описать процедуру 40 М. Э. Абрамян. Электронный задачник Programming Taskbook 4.4 Heights(xA, yA, xB, yB, xC, yC, hA, hB, hC), находящую высоты hA, hB, hC тре- угольника ABC (выходные параметры), проведенные соответственно из вершин A, B, C (их координаты являются входными параметрами). С по- мощью этой процедуры найти высоты треугольников ABC, ABD, ACD, если даны координаты точек A, B, C, D. Минимумы и максимумы Для решения заданий из данной группы следует использовать «однопро- ходные» алгоритмы, позволяющие получить требуемый результат после од- нократного просмотра набора исходных данных. Однопроходные алгоритмы обладают важным преимуществом: для них не требуется хранить в памяти одновременно весь набор данных, поэтому при программной реализации этих алгоритмов можно не использовать массивы. Во всех заданиях данной группы предполагается, что исходный набор со- держит ненулевое количество элементов (в частности, число N всегда больше нуля)"""
import math
from math import sqrt
def solve(*values):
    v=list(values)
    import math; A,B,C=[tuple(v[i:i+2]) for i in range(0,6,2)]; area=abs((B[0]-A[0])*(C[1]-A[1])-(C[0]-A[0])*(B[1]-A[1]))/2; return [2*area/math.dist(B,C),2*area/math.dist(A,C),2*area/math.dist(A,B)]
if __name__ == "__main__":
    data=list(map(float,input().split()))
    print(solve(*data))
