"""Proc19. Описать функцию RingS(R1, R2) вещественного типа, находящую пло- щадь кольца, заключенного между двумя окружностями с общим центром и радиусами R1 и R2 (R1 и R2 — вещественные, R1 > R2). С ее помощью найти площади трех колец, для которых даны внешние и внутренние ра- диусы. Воспользоваться формулой площади круга радиуса R: S = π·R2. В качестве значения π использовать 3.14."""
import math
from math import sqrt
def solve(*values):
    v=list(values)
    return [3.14*(a*a-b*b) for a,b in zip(v[::2],v[1::2])]
if __name__ == "__main__":
    data=list(map(float,input().split()))
    print(solve(*data))
