"""Proc8*. Описать процедуру AddRightDigit(D, K), добавляющую к целому по- ложительному числу K справа цифру D (D — входной параметр целого типа, лежащий в диапазоне 0–9, K — параметр целого типа, являющийся одновременно входным и выходным). С помощью этой процедуры после- довательно добавить к данному числу K справа данные цифры D1 и D2, выводя результат каждого добавления."""
import math
from math import sqrt
def solve(*values):
    v=list(values)
    k,d1,d2=map(int,v); k=k*10+d1; return (k,k*10+d2)
if __name__ == "__main__":
    data=list(map(float,input().split()))
    print(solve(*data))
